
title: Mimikatz Credential Dumper Detection
id: e4d19460-9081-4e78-9f95-7d056b7ca59b
description: Detects the execution of credential dumper tools similar to Mimikatz, including NTLM hash theft or cleartext password extraction from LSASS.
status: experimental
author: Rayane Bendahmane (@rbendah)
date: 2024-11-10
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4697
    Service_Name|contains:
      - "cachedump"
      - "dumpsvc"
      - "fgexec"
      - "gsecdump"
      - "mimidrv"
      - "pwdump"
      - "servpw"
  condition: selection
fields:
  - _time
  - Account_Name
  - ComputerName
  - host
  - Service_Name
  - Service_Account
  - LogName
  - EventCode
falsepositives:
  - Legitimate service installations by authorized personnel
level: critical
tags:
  - attack.credential_access
  - attack.lateral_movement
  - attack.defense_evasion
