title: Privileged Logon from Specific IPs for Selected Accounts
id: 4b8c6f34-7d1a-4d8c-98a1-3e5f8c7d8a7b
description: Detects special logon events (Event ID 4672) from specific IP addresses for specified accounts with elevated privileges.
status: experimental
author: smakalou
date: 2024-10-23
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4672
    src_ip:
      - "192.168.10.10"
      - "192.168.10.21"
      - "192.168.10.22"
      - "192.168.10.23"
    Account_Name:
      - "Zane"
      - "Ethan"
      - "Scott"
      - "Willa"
      - "Victor"
      - "Lee"
      - "Taylor"
      - "Samuel"
      - "Noah"
  condition: selection
fields:
  - EventID
  - Account_Name
  - Privileges
  - ComputerName
  - src_ip
  - _time
falsepositives:
  - Authorized access by trusted accounts during administrative tasks
level: high
tags:
  - attack.privilege_escalation
  - attack.persistence
