title: SRV-PRD-... Detection of Connections to Malicious IPs
id: 5f371cbb-3c25-440c-9520-4e61bfbc5274
status: experimental
description: Detects connections made by SRV-PRD-... (-DC, -WEB, -DB, -SHARE) to malicious IP addresses.
author: Antoine Virgos (@avirgos)
date: 2024-10-26
tags:
  - attack.initial_access
  - attack.exfiltration
  - attack.persistence
  - attack.C2
  - attack.T1071.001        # Web Protocols
  - attack.T1071.004        # DNS
  - attack.T1071            # General C2 communication techniques
  - attack.T1105            # Transfer of tools from the adversary to a compromised environment
logsource:
  product: suricata
  service: network
detection:
  selection:
    src_ip:
      - 192.168.10.10
      - 192.168.10.21
      - 192.168.10.22
      - 192.168.10.23
  lookup:
    - file: malicious-ips.csv
      field: ip
      output: dest_ip
  condition: selection
  exclusion:
    - dest_ip: "93.184.221.240"
      flowbits: "ET.INFO.WindowsUpdate"
  groupby:
    - src_ip
    - src_port
    - dest_ip
    - dest_port
fields:
  - src_ip
  - src_port
  - dest_ip
  - dest_port
falsepositives:
  - Unknown
level: high