title: Suricata SRV-PRD-DB Detection of Connections to Malicious IPs
id: 38fe02b0-cc8e-4fd2-9281-d5577913ceb4
status: experimental
description: Detect connections made by SRV-PRD-DB (192.168.10.22) to malicious IP addresses.
author: Antoine Virgos (@avirgos)
logsource:
  product: network
  service: suricata
detection:
  selection:
    src_ip: "192.168.10.22"
  condition: selection
  lookup:
    - dest_ip:
        from: malicious-ips.csv
        column: ip
fields:
  - dest_ip
  - dest_port
  - src_ip
  - count
falsepositives:
  - Unknown
level: high