title: Suricata SRV-PRD-SHARE Detection of Connections to Malicious IPs
id: a70ec848-4b45-4afd-919f-93dba01ed9f1
status: experimental
description: Detect connections made by SRV-PRD-SHARE (192.168.10.23) to malicious IP addresses.
author: Antoine Virgos (@avirgos)
logsource:
  product: network
  service: suricata
detection:
  selection:
    src_ip: "192.168.10.23"
  condition: selection
  lookup:
    - dest_ip:
        from: malicious-ips.csv
        column: ip
fields:
  - dest_ip
  - dest_port
  - src_ip
  - count
falsepositives:
  - Unknown
level: high