title: Suspicious Access to Microsoft SQL Server Named Pipe
id: c0bff9aa-6749-4d1c-bf4a-345d98a8b4a1
description: Detects access to a specific named pipe associated with Microsoft SQL Server (\\MICROSOFT##WID\\tsql\\query) by potentially unauthorized processes.
author: Philemon St Jean
date: 2024/11/10
logsource:
  category: pipe_access
  product: windows
detection:
  selection:
    EventChannel: "WinEventLog:*"
    PipeName: "\\MICROSOFT##WID\\tsql\\query"
  exclusion:
    ProcessName|contains:
      - "\\Windows\\System32\\mmc.exe"
      - "\\Windows\\system32\\svchost.exe"
      - "\\Windows\\System32\\wsmprovhost.exe"
      - "\\Windows\\SysWOW64\\mmc.exe"
      - "\\Windows\\SysWOW64\\wsmprovhost.exe"
      - "\\Windows\\WID\\Binn\\sqlwriter.exe"
      - "\\AzureADConnect.exe"
      - "\\Microsoft.Identity.Health.Adfs.PshSurrogate.exe"
      - "\\Microsoft.IdentityServer.ServiceHost.exe"
      - "\\Microsoft.Tri.Sensor.exe"
      - "\\sqlservr.exe"
      - "\\tssdis.exe"
  condition: selection AND NOT exclusion
fields:
  - PipeName
  - ProcessName
level: high
tags:
  - attack.persistence
  - attack.T1559
  - attack.T1559.002
