title: Execution of Addinutil.exe
id: 1a23bc45-d67e-89f0-gh12-34ij56kl789m
description: Detects the execution of addinutil.exe, which may indicate suspicious or unauthorized activity.
author: Philemon St Jean
date: 2024/11/10
logsource:
  category: process_creation
  product: windows
  service: sysmon
detection:
  selection:
    Channel: "Microsoft-Windows-Sysmon/Operational"
    EventID: 1  # Sysmon EventID 1 indicates process creation
    Initiated: "true"
    Image|endswith: "\\addinutil.exe"
  condition: selection
fields:
  - EventID
  - Image
  - Initiated
level: medium
tags:
  - attack.execution
  - attack.T1218
  - attack.T1218.009
