title: Suspicious Process Creation in Temp or AppData
id: 958894bb-e83d-4048-b623-6146d7d3699b 
status: experimental
description: Detects process creation in temporary directories : Temp or AppData.
author: Antoine Virgos (@avirgos)
date: 2024-11-02
tags:
  - mitre.technique.T1059         # Command-Line Interface usage for executing commands
  - mitre.technique.T1203         # Exploitation of client-side applications
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    EventID: 1
    Image|contains:
      - '\Temp\'
      - '\AppData\'
  condition: selection
fields:
  - Image
  - ParentImage
  - User
falsepositives:
  - MpSigStub.exe | Microsoft Windows Defender)
  - MpCmdRun.exe | Microsoft Windows Defender
level: high