title: Accès Suspect aux Fichiers de Crédentiels SAM ou NTDS avec Esentutl
id: 57551656-ebdb-11eb-afdf-acde48001122
description: Cette alerte détecte des tentatives d'accès aux fichiers critiques de crédentiels (SAM ou ntds.dit) en utilisant esentutl.exe, qui est souvent exploité dans les attaques pour copier ou extraire des informations d'identification.
status: production
author: Ayet Merzouqi
date: 2024-11-09
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 1
    Image: '*\\esentutl.exe'
    CommandLine|contains:
      - 'ntds'
      - 'SAM'
  condition: selection
fields:
  - _time
  - ComputerName
  - User
  - ParentImage
  - Image
  - CommandLine
  - ProcessId
  - ParentProcessId
falsepositives:
  - Tâches d'administration légitimes (vérifier avec l’équipe SI)
level: high
tags:
  - attack.credential_access
  - attack.persistence
  - attack.t1003.002
action:
  - Create AME Event
